app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "password_digest", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-12-30 17:07:57.615557"], ["password_digest", "$2a$10$bNH2X8a7dyvLiVeOEuwgtu3edYEZt9I49RvE8qbg3BtRoBPHbZ05."], ["updated_at", "2014-12-30 17:07:57.615557"]]
---
  def create
    @user = User.new(user_params)
    if @user.save